import logo from './logo.svg';
import './App.css';
import CurrentTime from './currentTime';
import Timer from './timer';
import Text from './text';

function App() {
  return (
    <div className="App">
        <p>1. Створіть програму, яка відображає поточний час.
        Обов'язково використовуйте функціональні компоненти.</p>
        <CurrentTime/>  <br/>
        <p>2. Створіть програму «Таймер». Користувач вводить
          кількість секунд та натискає кнопку «Старт». Відразу
          після натискання починається зворотний відлік. Користувачеві також доступні кнопки "Стоп" та "Пауза".</p>
        <Timer/>        <br/>
        <p>3. Створіть програму для транслітерації тексту.
          Користувач вводить текст у текстове поле. В іншому текстовому полі відображається транслітерірований
          текст.</p>
        <Text/>         <br/>
    </div>
  );
}

export default App;
